; domain
; Domain file for the Problem 2 of APTP Assignment

(define (domain assignment2)

    (:requirements :strips :typing :fluents)

    (:types
        robot ; robotic agent
        person
        crate
        location
        content ; content of creates: food, medicine, ...
        carrier
    )

    (:predicates
        (robot_at ?r - robot ?l - location) ;robot r is at location l
        (person_at ?p - person ?l - location) ;person p is at location l
        (crate_at ?c - crate ?l - location) ;crate c is at location l
        (carrier_at ?ca - carrier ?l - location) ;carrier ca is at location l
        (contain ?c - crate ?co - content) ;crate c has content co
        (available ?c - crate) ;crate c has not been delivered yet
        (need ?p - person ?co - content) ;person p needs content co
        (have ?p - person ?co - content) ;person p has content co
        (load ?ca - carrier ?c - crate) ;carrier ca loads crate c
    )


    (:functions
        (capacity ?ca - carrier) - number ; carrier ca remaining capacity
        (cost) - number ; TODO
    )

    ; robot r picks up and puts crate c at location l into carrier ca
    ; capacity of carrier ca will be decreased by 1
    (:action pick_up
        :parameters (?r - robot ?ca - carrier ?c - crate ?l - location)
        :precondition (and (robot_at ?r ?l) (carrier_at ?ca ?l) (crate_at ?c ?l) 
                            (available ?c) (> (capacity ?ca) 0))
        :effect (and (load ?ca ?c) (decrease (capacity ?ca) 1) (not (crate_at ?c ?l)) (increase (cost) 1))
    )
    
    ; robot r moves carrier ca from location l1 to location l2
    (:action move_carrier
        :parameters (?r - robot ?ca - carrier ?l1 ?l2 - location)
        :precondition (and (robot_at ?r ?l1) (carrier_at ?ca ?l1))
        :effect (and (robot_at ?r ?l2) (carrier_at ?ca ?l2) 
                    (not (robot_at ?r ?l1)) (not (carrier_at ?ca ?l1)) (increase (cost) 1))
    )
    
    ; robot r moves from location l1 to location l2
    (:action move
        :parameters (?r - robot ?l1 ?l2 - location)
        :precondition (and (robot_at ?r ?l1))
        :effect (and (robot_at ?r ?l2) (not (robot_at ?r ?l1)) (increase (cost) 1))
    )

    ; robot r delivers crate c with content co, situated in carrier ca, to person p at location l
    (:action deliver
        :parameters (?r - robot ?ca - carrier ?c - crate ?p - person ?l - location ?co - content)
        :precondition (and (robot_at ?r ?l) (carrier_at ?ca ?l) (person_at ?p ?l) 
                        (load ?ca ?c) (contain ?c ?co) (need ?p ?co))
        :effect (and (not (need ?p ?co)) (have ?p ?co) (crate_at ?c ?l) 
                    (not (load ?ca ?c)) (increase (capacity ?ca) 1) (not (available ?c)) (increase (cost) 1))
    )

)

; problem
(define (problem problem2) (:domain assignment2)
    (:objects 
        robot1 - robot
        p1 p2 p3 p4 p5 p6 - person
        c1 c2 c3 c4 c5 c6 - crate
        depot l1 l2 l3 - location
        medicine food beverage - content
        carrier1 - carrier
    )

    (:init
        (robot_at robot1 depot) 
        (carrier_at carrier1 depot)
        (person_at p1 l1) (person_at p2 l1) (person_at p3 l1) (person_at p4 l2) (person_at p5 l2) (person_at p6 l3)
        (crate_at c1 depot) (crate_at c2 depot) (crate_at c3 depot) (crate_at c4 depot) (crate_at c5 depot) (crate_at c6 depot) 
        (contain c1 medicine) (contain c2 food) (contain c3 beverage) (contain c4 medicine) (contain c5 food) (contain c6 beverage)
        (available c1) (available c2) (available c3) (available c4) (available c5) (available c6)
        (need p1 food) (need p1 beverage)
        (need p3 medicine)
        (need p4 food)
        (need p5 medicine)
        (need p6 beverage)
        (have p1 medicine) (have p2 food) (have p3 beverage)
        (= (capacity carrier1) 4)
        (= (cost) 0)
    )

    (:goal (and
        (have p1 food) (have p1 beverage)
        (have p3 medicine)
        (have p4 food)
        (have p5 medicine)
        (have p6 beverage)
        ; (< (cost) 17)
    ))

    ;un-comment the following line if metric is needed
    (:metric minimize (cost))
    ; min cost 16 
)

; plan
1. (pick_up robot1 carrier1 c1 depot)
   deleted: (crate_at c1 depot)
   added: (load carrier1 c1)
   changed: (capacity carrier1) from 4 to 3, (cost) from 0 to 1
   goals met: 0 of 6
2. (pick_up robot1 carrier1 c3 depot)
   deleted: (crate_at c3 depot)
   added: (load carrier1 c3)
   changed: (capacity carrier1) from 3 to 2, (cost) from 1 to 2
   goals met: 0 of 6
3. (pick_up robot1 carrier1 c2 depot)
   deleted: (crate_at c2 depot)
   added: (load carrier1 c2)
   changed: (capacity carrier1) from 2 to 1, (cost) from 2 to 3
   goals met: 0 of 6
4. (move_carrier robot1 carrier1 depot l2)
   deleted: (robot_at robot1 depot) (carrier_at carrier1 depot)
   added: (robot_at robot1 l2) (carrier_at carrier1 l2)
   changed: (cost) from 3 to 4
   goals met: 0 of 6
5. (deliver robot1 carrier1 c1 p5 l2 medicine)
   deleted: (need p5 medicine) (load carrier1 c1) (available c1)
   added: (have p5 medicine) (crate_at c1 l2)
   changed: (capacity carrier1) from 1 to 2, (cost) from 4 to 5
   goals met: 1 of 6
6. (deliver robot1 carrier1 c2 p4 l2 food)
   deleted: (need p4 food) (load carrier1 c2) (available c2)
   added: (have p4 food) (crate_at c2 l2)
   changed: (capacity carrier1) from 2 to 3, (cost) from 5 to 6
   goals met: 2 of 6
7. (move_carrier robot1 carrier1 l2 depot)
   deleted: (robot_at robot1 l2) (carrier_at carrier1 l2)
   added: (robot_at robot1 depot) (carrier_at carrier1 depot)
   changed: (cost) from 6 to 7
   goals met: 2 of 6
8. (pick_up robot1 carrier1 c5 depot)
   deleted: (crate_at c5 depot)
   added: (load carrier1 c5)
   changed: (capacity carrier1) from 3 to 2, (cost) from 7 to 8
   goals met: 2 of 6
9. (pick_up robot1 carrier1 c4 depot)
   deleted: (crate_at c4 depot)
   added: (load carrier1 c4)
   changed: (capacity carrier1) from 2 to 1, (cost) from 8 to 9
   goals met: 2 of 6
10. (pick_up robot1 carrier1 c6 depot)
   deleted: (crate_at c6 depot)
   added: (load carrier1 c6)
   changed: (capacity carrier1) from 1 to 0, (cost) from 9 to 10
   goals met: 2 of 6
11. (move_carrier robot1 carrier1 depot l3)
   deleted: (robot_at robot1 depot) (carrier_at carrier1 depot)
   added: (robot_at robot1 l3) (carrier_at carrier1 l3)
   changed: (cost) from 10 to 11
   goals met: 2 of 6
12. (deliver robot1 carrier1 c6 p6 l3 beverage)
   deleted: (need p6 beverage) (load carrier1 c6) (available c6)
   added: (have p6 beverage) (crate_at c6 l3)
   changed: (capacity carrier1) from 0 to 1, (cost) from 11 to 12
   goals met: 3 of 6
13. (move_carrier robot1 carrier1 l3 l1)
   deleted: (robot_at robot1 l3) (carrier_at carrier1 l3)
   added: (robot_at robot1 l1) (carrier_at carrier1 l1)
   changed: (cost) from 12 to 13
   goals met: 3 of 6
14. (deliver robot1 carrier1 c4 p3 l1 medicine)
   deleted: (need p3 medicine) (load carrier1 c4) (available c4)
   added: (have p3 medicine) (crate_at c4 l1)
   changed: (capacity carrier1) from 1 to 2, (cost) from 13 to 14
   goals met: 4 of 6
15. (deliver robot1 carrier1 c5 p1 l1 food)
   deleted: (need p1 food) (load carrier1 c5) (available c5)
   added: (have p1 food) (crate_at c5 l1)
   changed: (capacity carrier1) from 2 to 3, (cost) from 14 to 15
   goals met: 5 of 6
16. (deliver robot1 carrier1 c3 p1 l1 beverage)
   deleted: (need p1 beverage) (load carrier1 c3) (available c3)
   added: (have p1 beverage) (crate_at c3 l1)
   changed: (capacity carrier1) from 3 to 4, (cost) from 15 to 16
   goals met: 6 of 6
